__author__ = 'Чудесников Никита'

# Задача-2:
# Напишите скрипт, отображающий папки текущей директории.

from os import listdir
print (listdir())